//     Дата: 01 сентября 2012
//    Автор: Дмитрий Бравиков (bravikov@gmail.com)
// Описание: см. div2-search.h

#include "div2-search.h"

unsigned div2_search_iteration_count = 0;

int div2_search_free_position(const unsigned size)
{
    // Диапазон поиска: [l,r)
    unsigned  l = 0;     // Ограничение слева
    unsigned  r = size;  // Ограничение справа
    unsigned  c = r / 2; // Текущая позиция

    div2_search_iteration_count = 0;

    if (size == 0) return -1;

    while (r != l)
    {
        if ( div2_search_is_data(c) )
        {
            l = c + 1;
        }
        else
        {
            r = c;
        }

        c = l + (r - l) / 2;
        
        div2_search_iteration_count++;
    }

    return c;
}

// Примеры поиска:
//
// -----------------------------------------------------------------------------
// Итерация:       2 4 3 1
// Позиция:  0 1 2 3 4 5 6 7 8 9 10 11
// Данные:   * * * *
//
// Результат: 4
// -----------------------------------------------------------------------------
// Итерация:             1 4 3 2
// Позиция:  0 1 2 3 4 5 6 7 8 9 10 11
// Данные:   * * * * * * *
//
// Результат: 7
// -----------------------------------------------------------------------------
// Итерация: 4 3   2     1
// Позиция:  0 1 2 3 4 5 6 7 8 9 10 11
// Данные:
// 
// Результат: 0
// -----------------------------------------------------------------------------
// Итерация:             1     2     3
// Позиция:  0 1 2 3 4 5 6 7 8 9 10 11
// Данные:   * * * * * * * * * *  *  *
//
// Результат: 12
// -----------------------------------------------------------------------------

